<!-- dflook/terraform-github-actions {"workspace":"refresh-2-2","backend_type":"remote","backend":"4b957cb0137d9cad4e3181533fc74f4b8b1fd4a19cafe2007e0492a123098668","plan_job_ref":"Job Test Terraform cloud #296 at https://github.com/dflook/terraform-github-actions/actions/runs/14040972089","plan_hash":"b9388f162a7634ceeb7bb93fdd1b3fe59b39afa1574941d92a9f324e52338cb3","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __refresh-2-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #296](https://github.com/dflook/terraform-github-actions/actions/runs/14040972089)